In [1]:
%load_ext sql

# Aggregate functions
- Aggregate functions in SQL are used to perform calculations on sets of values and return a single result.

# COUNT
- Definition: COUNT is used to count the number of rows that match a specified condition.

In [2]:
%%sql mysql://root:redhat@localhost:3306/mydb
select count(*) as Total_count from product;

1 rows affected.

[(14,)]

In [3]:
%%sql mysql://root:redhat@localhost:3306/mydb
select count(id) as Total_id from product;

1 rows affected.

[(14,)]

# SUM
- SUM is used to calculate the sum of a numeric column's values.

In [4]:
%%sql mysql://root:redhat@localhost:3306/mydb

select sum(sales) as Total_sales from product;

1 rows affected.

[(Decimal('835'),)]

In [5]:
%%sql mysql://root:redhat@localhost:3306/mydb

select sum(sales) as Total_sales from product where category="clothing";

1 rows affected.

[(Decimal('320'),)]

# AVG
- AVG calculates the average of a numeric column's values.

In [6]:
%%sql mysql://root:redhat@localhost:3306/mydb

select avg(price) as avg_price from product;

1 rows affected.

[(Decimal('135.7143'),)]

In [7]:
%%sql mysql://root:redhat@localhost:3306/mydb

select avg(price) as avg_price from product where category="Electronics";

1 rows affected.

[(Decimal('332.5000'),)]

# MAX
- MAX returns the maximum value from a column

In [8]:
%%sql mysql://root:redhat@localhost:3306/mydb

select max(price) as max_price from product;

1 rows affected.

[(500,)]

In [9]:
%%sql mysql://root:redhat@localhost:3306/mydb

select max(sales) as max_sales from product where category="clothing";

1 rows affected.

[(150,)]

# MIN
- MIN returns the minimum value from a column.

In [10]:
%%sql mysql://root:redhat@localhost:3306/mydb

select min(price) as min_price from product;

1 rows affected.

[(15,)]

In [11]:
%%sql mysql://root:redhat@localhost:3306/mydb

select min(sales) as min_sales from product where category="clothing";

1 rows affected.

[(80,)]